Белгипрозем_2017/src/Catalogs/ПроизошедшиеБизнесСобытия/ПроизошедшиеБизнесСобытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПроизошедшиеБизнесСобытия</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>CatalogRef.ВидыБизнесСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтекстСобытия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/ВизыСогласования/ВизыСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВизыСогласования</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПомещенияВИсторию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.Согласование</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоместилВИсторию</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПомещенаВИсторию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатСогласования</name>
    <type>
      <types>EnumRef.РезультатыСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановилРезультат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/Резолюции/Резолюции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Резолюции</name>
  <attributes>
    <name>АвторРезолюции</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнесРезолюцию</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезолюции</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресацииАвтора</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.Рассмотрение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресацииАвтора</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстРезолюции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/CommonModules/УдалениеОбъектовПереопределяемый/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает массив всех возможных типов связанных объектов
//
Функция ПолучитьТипыСвязанныхОбъектов() Экспорт
	
	МетаданныеСвязанныхОбъектов = Новый Массив;
	МетаданныеСвязанныхОбъектов.Добавить(Метаданные.Справочники.ВизыСогласования);
	МетаданныеСвязанныхОбъектов.Добавить(Метаданные.Справочники.Резолюции);
	МетаданныеСвязанныхОбъектов.Добавить(Метаданные.Справочники.ПроизошедшиеБизнесСобытия);
	МетаданныеСвязанныхОбъектов.Добавить(Метаданные.Документы.ВходящееСообщениеСВД);
	МетаданныеСвязанныхОбъектов.Добавить(Метаданные.Документы.ИсходящееСообщениеСВД);
	МетаданныеСвязанныхОбъектов.Добавить(Метаданные.Справочники.УведомленияПрограммы);
	
	Возврат МетаданныеСвязанныхОбъектов;
	
КонецФункции
	
// Находит объекты, которые согласно прикладной логике должны быть удалены 
// вместе с выбранными удаляемыми объектами
Функция ПолучитьТаблицуСвязанныхОбъектов(УдаляемыеОбъекты) Экспорт
	
	ТаблицаСвязанных = Новый ТаблицаЗначений;
	ТаблицаСвязанных.Колонки.Добавить("УдаляемыйОбъект");
	ТаблицаСвязанных.Колонки.Добавить("СвязанныйОбъект");
	ТаблицаСвязанных.Колонки.Добавить("ПометкаУдаленияСвязанного");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УдаляемыеОбъекты", УдаляемыеОбъекты);
		
	ДобавитьСвязанныеБизнесСобытия(Запрос, ТаблицаСвязанных);
	ДобавитьСвязанныеВизыСогласования(Запрос, ТаблицаСвязанных);
	ДобавитьСвязанныеРезолюции(Запрос, ТаблицаСвязанных);
	ДобавитьСвязанныеСообщенияСВД(Запрос, ТаблицаСвязанных);
	ДобавитьСвязанныеУведомленияПрограммы(Запрос, ТаблицаСвязанных);
	
	ТаблицаСвязанных.Свернуть("УдаляемыйОбъект, СвязанныйОбъект, ПометкаУдаленияСвязанного");
	
	Возврат ТаблицаСвязанных;
	
КонецФункции

// Удаляет записи регистров, имеющие ссылки на удаляемые объекты
// Параметры:
//  УдаляемыеОбъекты - массив удаляемых объектов
//
Процедура УдалитьДанныеСвязанныхРегистров(УдаляемыеОбъекты) Экспорт
	
	// ФактическиеТрудозатраты
	ИмяРегистра = "ФактическиеТрудозатраты";
	ПоляПоиска = Новый Массив;
	ПоляПоиска.Добавить("ЕжедневныйОтчет");
	УдалениеОбъектов.УдалитьДанныеСвязанногоРегистра(ИмяРегистра, ПоляПоиска, УдаляемыеОбъекты);
	
	// СвязанныеЗаписиКалендаря
	ИмяРегистра = "СвязанныеЗаписиКалендаря";
	ПоляПоиска = Новый Массив;
	ПоляПоиска.Добавить("ЗаписьКалендаря");
	УдалениеОбъектов.УдалитьДанныеСвязанногоРегистра(ИмяРегистра, ПоляПоиска, УдаляемыеОбъекты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Бизнес-события по источнику и виду
Процедура ДобавитьСвязанныеБизнесСобытия(Запрос, ТаблицаСвязанных)
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизошедшиеБизнесСобытия.Источник КАК УдаляемыйОбъект,
		|	ПроизошедшиеБизнесСобытия.Ссылка КАК СвязанныйОбъект,
		|	ПроизошедшиеБизнесСобытия.ПометкаУдаления КАК ПометкаУдаленияСвязанного
		|ИЗ
		|	Справочник.ПроизошедшиеБизнесСобытия КАК ПроизошедшиеБизнесСобытия
		|ГДЕ
		|	ПроизошедшиеБизнесСобытия.Источник В(&УдаляемыеОбъекты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПроизошедшиеБизнесСобытия.ВидСобытия,
		|	ПроизошедшиеБизнесСобытия.Ссылка,
		|	ПроизошедшиеБизнесСобытия.ПометкаУдаления
		|ИЗ
		|	Справочник.ПроизошедшиеБизнесСобытия КАК ПроизошедшиеБизнесСобытия
		|ГДЕ
		|	ПроизошедшиеБизнесСобытия.ВидСобытия В(&УдаляемыеОбъекты)";
		
	ДобавитьРезультатЗапросаВТаблицуСвязанных(Запрос, ТаблицаСвязанных);
		
КонецПроцедуры

// Визы согласования по источнику и документу
Процедура ДобавитьСвязанныеВизыСогласования(Запрос, ТаблицаСвязанных)
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВизыСогласования.Источник КАК УдаляемыйОбъект,
		|	ВизыСогласования.Ссылка КАК СвязанныйОбъект,
		|	ВизыСогласования.ПометкаУдаления КАК ПометкаУдаленияСвязанного
		|ИЗ
		|	Справочник.ВизыСогласования КАК ВизыСогласования
		|ГДЕ
		|	ВизыСогласования.Источник В(&УдаляемыеОбъекты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВизыСогласования.Документ,
		|	ВизыСогласования.Ссылка,
		|	ВизыСогласования.ПометкаУдаления
		|ИЗ
		|	Справочник.ВизыСогласования КАК ВизыСогласования
		|ГДЕ
		|	ВизыСогласования.Документ В(&УдаляемыеОбъекты)";
	
	
	ДобавитьРезультатЗапросаВТаблицуСвязанных(Запрос, ТаблицаСвязанных);
	
КонецПроцедуры	

// Резолюции по источнику и документу
Процедура ДобавитьСвязанныеРезолюции(Запрос, ТаблицаСвязанных)
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Резолюции.Источник КАК УдаляемыйОбъект,
		|	Резолюции.Ссылка КАК СвязанныйОбъект,
		|	Резолюции.ПометкаУдаления КАК ПометкаУдаленияСвязанного
		|ИЗ
		|	Справочник.Резолюции КАК Резолюции
		|ГДЕ
		|	Резолюции.Источник В(&УдаляемыеОбъекты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Резолюции.Документ,
		|	Резолюции.Ссылка,
		|	Резолюции.ПометкаУдаления
		|ИЗ
		|	Справочник.Резолюции КАК Резолюции
		|ГДЕ
		|	Резолюции.Документ В(&УдаляемыеОбъекты)";
	
	ДобавитьРезультатЗапросаВТаблицуСвязанных(Запрос, ТаблицаСвязанных);
	
КонецПроцедуры	

// Сообщения СВД по документу
Процедура ДобавитьСвязанныеСообщенияСВД(Запрос, ТаблицаСвязанных)
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВходящееСообщениеСВД.Документ КАК УдаляемыйОбъект,
		|	ВходящееСообщениеСВД.Ссылка КАК СвязанныйОбъект,
		|	ВходящееСообщениеСВД.ПометкаУдаления КАК ПометкаУдаленияСвязанного
		|ИЗ
		|	Справочник.Резолюции КАК Резолюции,
		|	Документ.ВходящееСообщениеСВД КАК ВходящееСообщениеСВД
		|ГДЕ
		|	ВходящееСообщениеСВД.Документ В(&УдаляемыеОбъекты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИсходящееСообщениеСВД.Документ,
		|	ИсходящееСообщениеСВД.Ссылка,
		|	ИсходящееСообщениеСВД.ПометкаУдаления
		|ИЗ
		|	Справочник.Резолюции КАК Резолюции,
		|	Документ.ИсходящееСообщениеСВД КАК ИсходящееСообщениеСВД
		|ГДЕ
		|	ИсходящееСообщениеСВД.Документ В(&УдаляемыеОбъекты)";
	
	ДобавитьРезультатЗапросаВТаблицуСвязанных(Запрос, ТаблицаСвязанных);
	
КонецПроцедуры	

// Уведомления программы по объектам
Процедура ДобавитьСвязанныеУведомленияПрограммы(Запрос, ТаблицаСвязанных)
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УведомленияПрограммы.Объект КАК УдаляемыйОбъект,
		|	УведомленияПрограммы.Ссылка КАК СвязанныйОбъект,
		|	УведомленияПрограммы.ПометкаУдаления КАК ПометкаУдаленияСвязанного
		|ИЗ
		|	Справочник.УведомленияПрограммы КАК УведомленияПрограммы
		|ГДЕ
		|	УведомленияПрограммы.Объект В(&УдаляемыеОбъекты)";
		
		
	ДобавитьРезультатЗапросаВТаблицуСвязанных(Запрос, ТаблицаСвязанных);
	
КонецПроцедуры

// Добавляет строки результата запроса к переданной таблице связанных объектов
Процедура ДобавитьРезультатЗапросаВТаблицуСвязанных(Запрос, ТаблицаСвязанных)
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаСвязанных.Добавить(), Выборка);
	КонецЦикла;	
		
КонецПроцедуры

#КонецОбласти
